In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

You are the owner of a Coding School : Named Zindua School and Would like to build a data driven decision making workflow. You are going to query your database to understand the key characteristics of your students.

Download the SQL File and runit to create and populate your Database Answer the following questions

In [4]:
%sql sqlite:///ZinduaSchoolStudent.db

In [5]:
%%sql CREATE TABLE Personal_details (
national_ID INTEGER(15) ,
stud_ID VARCHAR(15),
stud_name VARCHAR(100),
phone_number VARCHAR(15),
age INTEGER,
gender VARCHAR(10),
PRIMARY KEY(national_ID)
);

 * sqlite:///ZinduaSchoolStudent.db
Done.

[]

In [6]:
%%sql INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///ZinduaSchoolStudent.db
15 rows affected.

[]

In [7]:
%%sql CREATE TABLE school_details(
    stud_ID VARCHAR(15),
    current_home_county VARCHAR(20),
    secondary_school_county VARCHAR(20),
    residence VARCHAR(15),
    stud_email VARCHAR(50),
    PRIMARY KEY (stud_ID)
);

 * sqlite:///ZinduaSchoolStudent.db
Done.

[]

In [8]:
%%sql INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///ZinduaSchoolStudent.db
15 rows affected.

[]

In [9]:
%%sql UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite:///ZinduaSchoolStudent.db
15 rows affected.

[]

In [10]:
%%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///ZinduaSchoolStudent.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql CREATE TABLE contact_details (
    stud_email VARCHAR(50),
    phone_number VARCHAR(15),
    next_of_kin_name VARCHAR(50),
    next_of_kin_relation VARCHAR(10),
    next_of_kin_contacts VARCHAR(13),
    PRIMARY KEY (stud_email)
);

 * sqlite:///ZinduaSchoolStudent.db
Done.

[]

In [12]:
%%sql INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///ZinduaSchoolStudent.db
15 rows affected.

[]

In [13]:
%%sql UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///ZinduaSchoolStudent.db
15 rows affected.

[]

In [30]:
%sql SELECT * FROM contact_details;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('HermioneGranger@zinduaschool.ac', '0712345678', 'Darius Young', 'Father', '0782382383'),
 ('DracoMalfo@zinduaschool.ac', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 ('JaydenWamashati@zinduaschool.ac', '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 ('RonWeasley@zinduaschool.ac', '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 ('DoloresUmbridge@zinduaschool.ac', '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 ('HedwigTonks@zinduaschool.ac', '0767812345', 'Lebron James', 'Father', '0765439233'),
 ('ChaoChang@zinduaschool.ac', '0778123456', 'Magna Carter', 'Father', '0702526243'),
 ('CurfewYaeitpm@zinduaschool.ac', '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 ('ChaptrMukenya@zinduaschool.ac', '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 ('NatalieMpema@zinduaschool.ac', '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 ('CrewNundi@zinduaschool.ac', '0744567812', 'John Doe', 'Father', '0725737383'),
 ('BandiKagunda@zinduaschool.ac', '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 ('TestimonyOmolo@zinduaschool.ac', '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 ('CareerMpya@zinduaschool.ac', '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 ('DeamonAnduro@zinduaschool.ac', '0744421123', 'Getrude Karen', 'Mother', '0765748244')]

In [15]:
%sql DELETE FROM contact_details WHERE phone_number = '0755421123' AND next_of_kin_name = 'Getrude Karen';

 * sqlite:///ZinduaSchoolStudent.db
1 rows affected.

[]

In [16]:
%sql INSERT INTO contact_details VALUES('DeamonAnduro@zinduaschool.ac', '0744421123', 'Getrude Karen', 'Mother', '0765748244');

 * sqlite:///ZinduaSchoolStudent.db
1 rows affected.

[]

In [17]:
%%sql CREATE TABLE financial_details (
    stud_ID VARCHAR(15),
    stud_name VARCHAR(50),
    sem_fee INTEGER(6),
    fee_paid INTEGER(6),
    PRIMARY KEY(stud_ID)
);

 * sqlite:///ZinduaSchoolStudent.db
Done.

[]

In [18]:
%%sql INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///ZinduaSchoolStudent.db
15 rows affected.

[]

In [19]:
%%sql UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///ZinduaSchoolStudent.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [31]:
%sql SELECT * FROM financial_details;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000, 'True'),
 ('stud102', 'Draco Malfo', 25000, 19000, 'False'),
 ('stud103', 'Jayden Wamashati', 21900, 20000, 'False'),
 ('stud104', 'Ron Weasley', 22000, 22000, 'True'),
 ('stud105', 'Dolores Umbridge', 25000, 23400, 'False'),
 ('stud106', 'Hedwig Tonks', 25000, 27000, 'True'),
 ('stud107', 'Chao Chang', 24230, 21200, 'False'),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500, 'False'),
 ('stud109', 'Chaptr Mukenya', 25000, 24500, 'False'),
 ('stud110', 'Natalie Mpema', 25000, 25000, 'True'),
 ('stud111', 'Crew Nundi', 26000, 26000, 'True'),
 ('stud112', 'Bandi Kagunda', 25000, 20900, 'False'),
 ('stud113', 'Testimony Omolo', 25000, 22300, 'False'),
 ('stud114', 'Career Mpya', 19000, 19000, 'True'),
 ('stud115', 'Deamon Anduro', 20800, 20800, 'True')]

Using JOIN get the student names, school id, email, phone number (new_stud_details)

In [32]:
%%sql SELECT personal_details.stud_name, personal_details.stud_ID, personal_details.phone_number, school_details.stud_email
FROM personal_details
JOIN school_details
  ON personal_details.stud_ID=school_details.stud_ID;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('Hermione Granger', 'stud101', '0712345678', 'HermioneGranger@zinduaschool.ac'),
 ('Draco Malfo', 'stud102', '0723456781', 'DracoMalfo@zinduaschool.ac'),
 ('Jayden Wamashati', 'stud103', '0734567812', 'JaydenWamashati@zinduaschool.ac'),
 ('Ron Weasley', 'stud104', '0745678123', 'RonWeasley@zinduaschool.ac'),
 ('Dolores Umbridge', 'stud105', '0756781234', 'DoloresUmbridge@zinduaschool.ac'),
 ('Hedwig Tonks', 'stud106', '0767812345', 'HedwigTonks@zinduaschool.ac'),
 ('Chao Chang', 'stud107', '0778123456', 'ChaoChang@zinduaschool.ac'),
 ('Curfew Yaeitpm', 'stud108', '0781234567', 'CurfewYaeitpm@zinduaschool.ac'),
 ('Chaptr Mukenya', 'stud109', '0722345678', 'ChaptrMukenya@zinduaschool.ac'),
 ('Natalie Mpema', 'stud110', '0733456781', 'NatalieMpema@zinduaschool.ac'),
 ('Crew Nundi', 'stud111', '0744567812', 'CrewNundi@zinduaschool.ac'),
 ('Bandi Kagunda', 'stud112', '0755678123', 'BandiKagunda@zinduaschool.ac'),
 ('Testimony Omolo', 'stud113', '0766456781', 'TestimonyOmolo@zinduaschool.ac'),
 ('Career Mpya', 'stud114', '0741367812', 'CareerMpya@zinduaschool.ac'),
 ('Deamon Anduro', 'stud115', '0744421123', 'DeamonAnduro@zinduaschool.ac')]

Create a table with all the details from contacts to school and financial details (full_stud_details)

In [33]:
%%sql SELECT * FROM financial_details;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000, 'True'),
 ('stud102', 'Draco Malfo', 25000, 19000, 'False'),
 ('stud103', 'Jayden Wamashati', 21900, 20000, 'False'),
 ('stud104', 'Ron Weasley', 22000, 22000, 'True'),
 ('stud105', 'Dolores Umbridge', 25000, 23400, 'False'),
 ('stud106', 'Hedwig Tonks', 25000, 27000, 'True'),
 ('stud107', 'Chao Chang', 24230, 21200, 'False'),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500, 'False'),
 ('stud109', 'Chaptr Mukenya', 25000, 24500, 'False'),
 ('stud110', 'Natalie Mpema', 25000, 25000, 'True'),
 ('stud111', 'Crew Nundi', 26000, 26000, 'True'),
 ('stud112', 'Bandi Kagunda', 25000, 20900, 'False'),
 ('stud113', 'Testimony Omolo', 25000, 22300, 'False'),
 ('stud114', 'Career Mpya', 19000, 19000, 'True'),
 ('stud115', 'Deamon Anduro', 20800, 20800, 'True')]

 Create a table with all the details from contacts to school and financial details (full_stud_details)

In [34]:
%%sql CREATE TABLE full_stud_details AS
SELECT contact_details.stud_email, contact_details.phone_number, contact_details.next_of_kin_name, contact_details.next_of_kin_relation, contact_details.next_of_kin_contacts, school_details.stud_ID, school_details.current_home_county, school_details.secondary_school_county, school_details.residence, school_details.stud_email, financial_details.stud_ID, financial_details.stud_name, financial_details.sem_fee, financial_details.fee_paid
FROM contact_details
JOIN school_details ON contact_details.stud_email=school_details.stud_email
JOIN financial_details ON contact_details.stud_email=financial_details.stud_ID;

 * sqlite:///ZinduaSchoolStudent.db
(sqlite3.OperationalError) table full_stud_details already exists
[SQL: CREATE TABLE full_stud_details AS
SELECT contact_details.stud_email, contact_details.phone_number, contact_details.next_of_kin_name, contact_details.next_of_kin_relation, contact_details.next_of_kin_contacts, school_details.stud_ID, school_details.current_home_county, school_details.secondary_school_county, school_details.residence, school_details.stud_email, financial_details.stud_ID, financial_details.stud_name, financial_details.sem_fee, financial_details.fee_paid
FROM contact_details
JOIN school_details ON contact_details.stud_email=school_details.stud_email
JOIN financial_details ON contact_details.stud_email=financial_details.stud_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%sql SELECT * FROM full_stud_details;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[]

In [25]:
%%sql ALTER TABLE financial_details
ADD COLUMN fee_cleared TEXT DEFAULT 'False';

 * sqlite:///ZinduaSchoolStudent.db
Done.

[]

In [38]:
%%sql UPDATE financial_details
SET fee_cleared = 'True'
WHERE fee_paid >= sem_fee;

 * sqlite:///ZinduaSchoolStudent.db
7 rows affected.

[]

Get the national ID and name of all students who have cleared their fees (fee_cleared)

In [37]:
%%sql SELECT personal_details.national_ID, financial_details.stud_name
FROM personal_details
JOIN financial_details
  ON personal_details.stud_ID=financial_details.stud_ID
WHERE fee_cleared='True';

 * sqlite:///ZinduaSchoolStudent.db
Done.

[(344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (307243, 'Hedwig Tonks'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (321746, 'Career Mpya'),
 (390234, 'Deamon Anduro')]

 Get the total sum of fees paid so far and the total current deficit (total_fee_balance)

In [39]:
%%sql SELECT
    SUM(fee_paid) AS total_fees_paid,
    SUM(sem_fee - fee_paid) AS total_fee_balance
FROM financial_details;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[(339600, 19330)]

Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties (home_county_count)

In [40]:
%%sql SELECT current_home_county, COUNT(*) AS home_county_count
FROM school_details
GROUP BY current_home_county;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('Kericho', 3),
 ('Kiambu', 2),
 ('Kisumu', 2),
 ('Nairobi', 2),
 ('Nakuru', 3),
 ('Nyamira', 1),
 ('Samburu', 2)]

Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [49]:
%%sql SELECT
    school_details.secondary_school_county,
    SUM(CASE WHEN gender = 'Male' THEN 1 ELSE 0 END) AS male_student_count,
    SUM(CASE WHEN gender = 'Female' THEN 1 ELSE 0 END) AS female_student_count
FROM
    personal_details
JOIN school_details
  ON personal_details.stud_ID=school_details.stud_ID
GROUP BY
    school_details.secondary_school_county;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('Mombasa', 1, 3),
 ('Nairobi', 4, 2),
 ('Nakuru', 1, 2),
 ('Taita Taveta', 1, 0),
 ('Turkana', 1, 0)]

Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)

In [69]:
%%sql SELECT
    next_of_kin_relation,
    (SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) * 100.0 / (SELECT COUNT(*) FROM contact_details)) AS kin_percentage
FROM
    contact_details
UNION
SELECT
    next_of_kin_relation,
    (SUM(CASE WHEN next_of_kin_relation = 'Father' THEN 1 ELSE 0 END) * 100.0 / (SELECT COUNT(*) FROM contact_details)) AS kin_percentage
FROM
    contact_details;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('Father', 46.666666666666664), ('Father', 53.333333333333336)]

In [65]:
%%sql SELECT
    next_of_kin_relation,
    (SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) * 100.0 / (SELECT COUNT(*) FROM contact_details)) AS father_percentage,
    (SUM(CASE WHEN next_of_kin_relation = 'Father' THEN 1 ELSE 0 END) * 100.0 / (SELECT COUNT(*) FROM contact_details)) AS mother_percentage
FROM
    contact_details
GROUP BY
    next_of_kin_relation;

 * sqlite:///ZinduaSchoolStudent.db
Done.

[('Father', 0.0, 53.333333333333336), ('Mother', 46.666666666666664, 0.0)]